Public Attributes | List of all members
API_MeshType Struct Reference
Element Manager API
Represents a mesh. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_Elem_Head  | head
General element header.
short  | contPen
Pen attribute index of the mesh's contour.
short  | levelPen
Pen attribute index of the mesh's level lines.
API_AttributeIndex  | ltypeInd
Line type attribute index of mesh's contour.
API_AttributeIndex  | buildingMaterial
Building Material index of mesh's hatch.
API_OverriddenPen  | cutFillPen
Cut fill pens set in the building material can be overridden on the element level.
API_OverriddenPen  | cutFillBackgroundPen
Cut fill pens set in the building material can be overridden on the element level.
short  | sectContPen
Contour pen attribute index of the mesh 's fill in sections.
API_OverriddenAttribute  | topMat
Top material attribute override structure.
API_OverriddenAttribute  | sideMat
Side material attribute override structure.
API_OverriddenAttribute  | botMat
Bottom material attribute override structure.
bool  | materialsChained
Are surface materials chained?
bool  | useFloorFill
Use cover fill?
char  | smoothRidges
How the connecting surfaces to be shown in the PhotoRendering window: |APIRidge_AllSharp|All ridges sharp| |APIRidge_AllSmooth|All ridges smooth| |APIRidge_UserSharp|Only the user defined ridges are sharp|.
short  | showLines
False : hide secondary lines; true : show everything.
short  | skirt
Skirt: 1 = yes; 2 = no bottom; 3 = no.
double  | level
Height of base plane of the mesh from the floor level.
double  | skirtLevel
Distance of the mesh's bottom from the base plane of the mesh.
API_StoryVisibility  | visibilityCont
Visibility of mesh's contour line. On the element's own story the contour should allways be visible.
API_StoryVisibility  | visibilityFill
Visibility of mesh's cover fill.
API_LinkToSettings  | linkToSettings
Mode of linking to home story.
short  | floorFillPen
Pen attribute index of mesh's cover fill.
short  | floorFillBGPen
Background pen attribute index of the mesh's cover fill.
API_AttributeIndex  | floorFillInd
Fill attribute index of the mesh's cover fill.
bool  | useLocalOrigo
Use local origo for cover fill drawing?
bool  | use3DHatching
Reserved for internal use.
API_Polygon  | poly
The polygon of the mesh.
API_MeshLevel  | levelLines
The level lines of the mesh.
API_Coord  | locOrigo
Base coordinate of mesh's cover fill reference vector if it's linked to the element.
double  | fillAngle
Angle of mesh's cover fill reference vector if it's linked to the element.
Detailed Description
Represents a mesh.
Remarks
The elements' cut fill foreground and background pens inherit from the building material, and can be overridden on the element level. The elements' surface materials inherit from the building material, and can be overridden on the element level. For morph and mesh related memo data see the ACAPI_Element_GetMemo function. The elements' surface materials inherit from the building material, and can be overridden on the element level. For morph related memo data see the ACAPI_Element_GetMemo function.
Member Data Documentation
◆ botMat
 API_MeshType::botMat
Bottom material attribute override structure.
◆ buildingMaterial
 API_MeshType::buildingMaterial
Building Material index of mesh's hatch.
◆ contPen
 API_MeshType::contPen
Pen attribute index of the mesh's contour.
◆ cutFillBackgroundPen
 API_MeshType::cutFillBackgroundPen
Cut fill pens set in the building material can be overridden on the element level.
◆ cutFillPen
 API_MeshType::cutFillPen
Cut fill pens set in the building material can be overridden on the element level.
◆ fillAngle
 API_MeshType::fillAngle
Angle of mesh's cover fill reference vector if it's linked to the element.
◆ floorFillBGPen
 API_MeshType::floorFillBGPen
Background pen attribute index of the mesh's cover fill.
◆ floorFillInd
 API_MeshType::floorFillInd
Fill attribute index of the mesh's cover fill.
◆ floorFillPen
 API_MeshType::floorFillPen
Pen attribute index of mesh's cover fill.
◆ head
 API_MeshType::head
General element header.
◆ level
 API_MeshType::level
Height of base plane of the mesh from the floor level.
◆ levelLines
 API_MeshType::levelLines
The level lines of the mesh.
◆ levelPen
 API_MeshType::levelPen
Pen attribute index of the mesh's level lines.
◆ linkToSettings
 API_MeshType::linkToSettings
Mode of linking to home story.
◆ locOrigo
 API_MeshType::locOrigo
Base coordinate of mesh's cover fill reference vector if it's linked to the element.
◆ ltypeInd
 API_MeshType::ltypeInd
Line type attribute index of mesh's contour.
◆ materialsChained
 API_MeshType::materialsChained
Are surface materials chained?
◆ poly
 API_MeshType::poly
The polygon of the mesh.
◆ sectContPen
 API_MeshType::sectContPen
Contour pen attribute index of the mesh 's fill in sections.
◆ showLines
 API_MeshType::showLines
False : hide secondary lines; true : show everything.
◆ sideMat
 API_MeshType::sideMat
Side material attribute override structure.
◆ skirt
 API_MeshType::skirt
Skirt: 1 = yes; 2 = no bottom; 3 = no.
◆ skirtLevel
 API_MeshType::skirtLevel
Distance of the mesh's bottom from the base plane of the mesh.
◆ smoothRidges
 API_MeshType::smoothRidges
How the connecting surfaces to be shown in the PhotoRendering window: |APIRidge_AllSharp|All ridges sharp| |APIRidge_AllSmooth|All ridges smooth| |APIRidge_UserSharp|Only the user defined ridges are sharp|.
◆ topMat
 API_MeshType::topMat
Top material attribute override structure.
◆ use3DHatching
 API_MeshType::use3DHatching
Reserved for internal use.
◆ useFloorFill
 API_MeshType::useFloorFill
Use cover fill?
◆ useLocalOrigo
 API_MeshType::useLocalOrigo
Use local origo for cover fill drawing?
◆ visibilityCont
 API_MeshType::visibilityCont
Visibility of mesh's contour line. On the element's own story the contour should allways be visible.
◆ visibilityFill
 API_MeshType::visibilityFill
Visibility of mesh's cover fill.